[
    {
        "company" : "Freelance",
        "title" : "Software Engineer",
        "duration" : "January 2018 - Present",
        "description" : 
        [
            "Experience in creating simple automation and computational programs utilizing Java",
            "Utilized web scraping to create compolex website traversal programs",
            "Worked on creating full blown website with custom front and back ends"
        ]
        
    },
    {
        "company" : "Colorado State University",
        "title" : "Undergraduate Research Assistant",
        "duration" : "September 2021 - Present",
        "description" : 
        [
            "Assist in research related to software security"
        ]
        
    },
    {
        "company" : "Travelport",
        "title" : "Software Engineer",
        "duration" : "May 2021 - August 2021",
        "description" : 
        [
            "Worked within an Agile team utilizing a SCRUM workflow to complete stories assigned to me.",
            "Created a web automation tool GUI utilizing React which is being used by hundreds of employees within the company.",
            "Assisted in setting up effective CI/CD pipelines for teams using GitHub actions.",
            "Created POC migration of CI/CD pipelines in AzureDevOps to Github Actions."
        ]
        
    },
        {
        "company" : "Rocky Mountain Senior Care",
        "title" : "Lead Software Engineer",
        "duration" : "July 2022 - Feburary 2023",
        "description" : 
        [
            "Worked as a lead software developer. In charge of developing, planning, and managing projects utilizing a Agile workflow.",
            "Maintained existing applications written in PHP CodeIgniter and Angular.",
            "Created and developed new applications and features in React.js, Node.js, and MongoDB utilizing TypeScript.",
            "Containerized existing and new applications and developed and deployed them so that they followed high availability principles.",
            "Created new features like Electric Medication Prescribing that followed external industry APIs, standards and regulations",
            "Created and maintained CI/CD pipelines for code testing, staging, and production."
        ]
        
    }
]
